BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega324PB.PIC
        <edc:AdjustPoint edc:_addr="0x74" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x75" edc:access="-nnnnnnn" edc:cname="PCMSK4" edc:nzwidth="0x8" ltx:memberofperipheral="EXINT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCINT" edc:desc="Pin Change Enable Masks" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x76" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x78" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADC" edc:nzwidth="0x10" ltx:memberofperipheral="ADC"/>
        <edc:SFRDef edc:_addr="0x7A" edc:access="nnnnnnnn" edc:cname="ADCSRA" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPS" edc:desc="ADC  Prescaler Select Bits" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="2" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="2" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="4" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="8" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="16" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="32" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="64" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="128" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ADIE" edc:desc="ADC Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIF" edc:desc="ADC Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADATE" edc:desc="ADC  Auto Trigger Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADSC" edc:desc="ADC Start Conversion" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADEN" edc:desc="ADC Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x7B" edc:access="nn---nnn" edc:cname="ADCSRB" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADTS" edc:desc="ADC Auto Trigger Source bits" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Free Running mode" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Analog Comparator" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="External Interrupt Request 0" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Timer/Counter0 Compare Match A" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="Timer/Counter0 Overflow" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="Timer/Counter1 Compare Match B" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Timer/Counter1 Overflow" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Timer/Counter1 Capture Event" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="ACME" edc:desc="Analog Comparator Multiplexer Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOEN" edc:desc="Enable GPIO function of PE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x7C" edc:access="nnnnnnnn" edc:cname="ADMUX" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MUX" edc:desc="Analog Channel and Gain Selection Bits" edc:nzwidth="0x5">
                <edc:SFRFieldSemantic edc:cname="ADC0" edc:desc="ADC Single Ended Input pin 0" edc:when="(field &amp; 0x1F) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ADC1" edc:desc="ADC Single Ended Input pin 1" edc:when="(field &amp; 0x1F) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="ADC2" edc:desc="ADC Single Ended Input pin 2" edc:when="(field &amp; 0x1F) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="ADC3" edc:desc="ADC Single Ended Input pin 3" edc:when="(field &amp; 0x1F) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="ADC4" edc:desc="ADC Single Ended Input pin 4" edc:when="(field &amp; 0x1F) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="ADC5" edc:desc="ADC Single Ended Input pin 5" edc:when="(field &amp; 0x1F) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="ADC6" edc:desc="ADC Single Ended Input pin 6" edc:when="(field &amp; 0x1F) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="ADC7" edc:desc="ADC Single Ended Input pin 7" edc:when="(field &amp; 0x1F) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_ADC0_10X" edc:desc="ADC Differential Inputs Postive pin 0 Negative pin 0 10x Gain" edc:when="(field &amp; 0x1F) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="ADC1_ADC0_10X" edc:desc="ADC Differential Inputs Postive pin 1 Negative pin 0 10x Gain" edc:when="(field &amp; 0x1F) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_ADC0_200x" edc:desc="ADC Differential Inputs Postive pin 0 Negative pin 0 200x Gain" edc:when="(field &amp; 0x1F) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="ADC1_ADC0_200X" edc:desc="ADC Differential Inputs Postive pin 1 Negative pin 0 200x Gain" edc:when="(field &amp; 0x1F) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="ADC2_ADC2_10X" edc:desc="ADC Differential Inputs Postive pin 2 Negative pin 2 10x Gain" edc:when="(field &amp; 0x1F) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="ADC3_ADC2_10X" edc:desc="ADC Differential Inputs Postive pin 3 Negative pin 2 10x Gain" edc:when="(field &amp; 0x1F) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="ADC2_ADC2_200X" edc:desc="ADC Differential Inputs Postive pin 2 Negative pin 2 200x Gain" edc:when="(field &amp; 0x1F) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="ADC3_ADC2_200X" edc:desc="ADC Differential Inputs Postive pin 3 Negative pin 2 200x Gain" edc:when="(field &amp; 0x1F) == 0x0F"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 0 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x10"/>
                <edc:SFRFieldSemantic edc:cname="ADC1_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 1 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x11"/>
                <edc:SFRFieldSemantic edc:cname="ADC2_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 2 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="ADC3_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 3 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x13"/>
                <edc:SFRFieldSemantic edc:cname="ADC4_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 4 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x14"/>
                <edc:SFRFieldSemantic edc:cname="ADC5_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 5 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x15"/>
                <edc:SFRFieldSemantic edc:cname="ADC6_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 6 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x16"/>
                <edc:SFRFieldSemantic edc:cname="ADC7_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 7 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x17"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 0 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x18"/>
                <edc:SFRFieldSemantic edc:cname="ADC1_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 1 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x19"/>
                <edc:SFRFieldSemantic edc:cname="ADC2_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 2 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x1A"/>
                <edc:SFRFieldSemantic edc:cname="ADC3_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 3 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x1B"/>
                <edc:SFRFieldSemantic edc:cname="ADC4_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 4 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x1C"/>
                <edc:SFRFieldSemantic edc:cname="ADC5_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 5 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x1D"/>
                <edc:SFRFieldSemantic edc:cname="ADC_VBG" edc:desc="Internal Reference (VBG)" edc:when="(field &amp; 0x1F) == 0x1E"/>
                <edc:SFRFieldSemantic edc:cname="ADC_GND" edc:desc="0V (GND)" edc:when="(field &amp; 0x1F) == 0x1F"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ADLAR" edc:desc="Left Adjust Result" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REFS" edc:desc="Reference Selection Bits" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="AREF, Internal Vref turned off" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="AVCC with external capacitor at AREF pin" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Internal 1.1V Voltage Reference with external capacitor at AREF pin" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Internal 2.56V Voltage Reference with external capacitor at AREF pin" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x7D" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x7E" edc:access="nnnnnnnn" edc:cname="DIDR0" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC0D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC1D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC2D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC3D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC4D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC5D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC6D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADC7D" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x7F" edc:access="------nn" edc:cname="DIDR1" edc:nzwidth="0x8" ltx:memberofperipheral="AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AIN0D" edc:desc="AIN0 Digital Input Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIN1D" edc:desc="AIN1 Digital Input Disable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
