BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega324PB.PIC
      <edc:DCRDef edc:_addr="0x1" edc:access="nnnnnnnn" edc:cname="HIGH" edc:factorydefault="0x99" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BOOTRST" edc:desc="Boot Reset vector Enabled" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="BOOTSZ" edc:desc="Select Boot Size" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="256W_3F00" edc:desc="Boot Flash size=256 words start address=$3F00" edc:when="(field &amp; 0x3) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="512W_3E00" edc:desc="Boot Flash size=512 words start address=$3E00" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="1024W_3C00" edc:desc="Boot Flash size=1024 words start address=$3C00" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="2048W_3800" edc:desc="Boot Flash size=2048 words start address=$3800" edc:when="(field &amp; 0x3) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EESAVE" edc:desc="Preserve EEPROM through the Chip Erase cycle" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="WDTON" edc:desc="Watchdog timer always on" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="SPIEN" edc:desc="Serial program downloading (SPI) enabled" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Interface Enabled" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="OCDEN" edc:desc="On-Chip Debug Enabled" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x2" edc:access="----nnnn" edc:cname="EXTENDED" edc:factorydefault="0xF7" edc:impl="0xF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BODLEVEL" edc:desc="Brown-out Detector trigger level" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="DISABLED" edc:desc="Brown-out detection disabled" edc:when="(field &amp; 0x7) == 0x07"/>
              <edc:DCRFieldSemantic edc:cname="1V8" edc:desc="Brown-out detection at VCC=1.8 V" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:DCRFieldSemantic edc:cname="2V7" edc:desc="Brown-out detection at VCC=2.7 V" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:DCRFieldSemantic edc:cname="4V3" edc:desc="Brown-out detection at VCC=4.3 V" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CFD" edc:desc="Clock Failure Detection" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="CFD_DISABLED" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="CFD_ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:FusesSpace>
  <edc:LockbitsSpace edc:magicoffset="0x830000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x1" edc:regionid="LOCKBITS">
      <edc:DCRDef edc:_addr="0x0" edc:access="--nnnnnn" edc:cname="LOCKBIT" edc:factorydefault="0x0" edc:impl="0x3F" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="LB" edc:desc="Memory Lock" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="PROG_VER_DISABLED" edc:desc="Further programming and verification disabled" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="PROG_DISABLED" edc:desc="Further programming disabled" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="NO_LOCK" edc:desc="No memory lock features enabled" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BLB0" edc:desc="Boot Loader Protection Mode" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="LPM_SPM_DISABLE" edc:desc="LPM and SPM prohibited in Application Section" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="LPM_DISABLE" edc:desc="LPM prohibited in Application Section" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="SPM_DISABLE" edc:desc="SPM prohibited in Application Section" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="NO_LOCK" edc:desc="No lock on SPM and LPM in Application Section" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BLB1" edc:desc="Boot Loader Protection Mode" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="LPM_SPM_DISABLE" edc:desc="LPM and SPM prohibited in Boot Section" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="LPM_DISABLE" edc:desc="LPM prohibited in Boot Section" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="SPM_DISABLE" edc:desc="SPM prohibited in Boot Section" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="NO_LOCK" edc:desc="No lock on SPM and LPM in Boot Section" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5"/>
      <edc:VirtualPin edc:name="ICP" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTB5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y29" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTB6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y30" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7"/>
      <edc:VirtualPin edc:name="OCB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTB7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y31" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RESET"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VCC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE0"/>
      <edc:VirtualPin edc:name="PCINT32" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTE0" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE1"/>
      <edc:VirtualPin edc:name="PCINT33" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTE1" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0"/>
      <edc:VirtualPin edc:name="PCINT24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTD0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="T" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y8" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1"/>
      <edc:VirtualPin edc:name="PCINT25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTD1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y9" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2"/>
      <edc:VirtualPin edc:name="INT0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT26" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTD2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y10" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3"/>
      <edc:VirtualPin edc:name="INT1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTD3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y11" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4"/>
      <edc:VirtualPin edc:name="OCB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT28" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTD4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y12" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5"/>
      <edc:VirtualPin edc:name="OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT29" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTD5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y13" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6"/>
      <edc:VirtualPin edc:name="ICP" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTD6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y14" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7"/>
      <edc:VirtualPin edc:name="OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTD7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y15" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE2"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTE2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y16" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE3"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTE3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y17" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC0"/>
      <edc:VirtualPin edc:name="PCINT16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTC0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCL0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y18" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC1"/>
      <edc:VirtualPin edc:name="PCINT17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTC1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SDA0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y19" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC2"/>
      <edc:VirtualPin edc:name="PCINT18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTC2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="T" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TCK" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y20" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC3"/>
      <edc:VirtualPin edc:name="ICP" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTC3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TMS" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y21" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC4"/>
      <edc:VirtualPin edc:name="OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTC4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TDO" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y22" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC5"/>
      <edc:VirtualPin edc:name="AC" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTC5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TDI" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="X15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y23" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC6"/>
      <edc:VirtualPin edc:name="PCINT22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTC6" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC7"/>
      <edc:VirtualPin edc:name="PCINT23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTC7" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVCC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE4"/>
      <edc:VirtualPin edc:name="PORTE4" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7"/>
      <edc:VirtualPin edc:name="ADC7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTA7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y7" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA6"/>
      <edc:VirtualPin edc:name="ADC6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTA6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y6" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5"/>
      <edc:VirtualPin edc:name="ADC5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTA5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y5" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4"/>
      <edc:VirtualPin edc:name="ADC4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTA4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y4" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3"/>
      <edc:VirtualPin edc:name="ADC3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTA3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y3" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA2"/>
      <edc:VirtualPin edc:name="ADC2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTA2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y2" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA1"/>
      <edc:VirtualPin edc:name="ADC1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTA1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y1" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA0"/>
      <edc:VirtualPin edc:name="ADC0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTA0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y0" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE5"/>
      <edc:VirtualPin edc:name="PORTE5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SDA1" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE6"/>
      <edc:VirtualPin edc:name="PORTE6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCL1" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0"/>
      <edc:VirtualPin edc:name="PCINT8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTB0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="T" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y24" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1"/>
      <edc:VirtualPin edc:name="CLK0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTB1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="T" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y25" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="INT2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTB2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y26" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="OCA" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTB3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y27" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4"/>
      <edc:VirtualPin edc:name="OCB" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCINT12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PORTB4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="Y28" edc:ppsfunction="default"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>